---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.CanASlopeBeApplied
source: html/6085dc40-f65f-e449-4f59-201c544c4947.htm
---
# Autodesk.Revit.DB.FabricationPart.CanASlopeBeApplied Method

This will test if a slope can be applied to the part and maintain connections with any connected parts.

## Syntax (C#)
```csharp
public bool CanASlopeBeApplied()
```

## Returns
Returns true if the part can be successfully sloped otherwise false.